*Pandas*
1.String IO
2.Pandas read_csv

In [ ]:
from io from

In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('data.csv')

In [3]:
df

         Name  Roll  Age
0       S.Dey    24   19
1  M.Banerjee     7   20
2      S.Pati    44   20

In [5]:
df.head()

         Name  Roll  Age
0       S.Dey    24   19
1  M.Banerjee     7   20
2      S.Pati    44   20

In [6]:
df

         Name  Roll  Age
0       S.Dey    24   19
1  M.Banerjee     7   20
2      S.Pati    44   20

In [8]:
df

         Name  Roll  Age
0       S.Dey    24   19
1  M.Banerjee     7   20
2      S.Pati    44   20

In [11]:
df=pd.read_csv('data.csv')
df

         Name  Roll  Age
0       S.Dey    24   19
1  M.Banerjee     7   20
2      S.Pati    44   20
3       M.Dey    23   20
4     P.Lorem    45   67

In [13]:
data=('Col1,Col2,Col3\n'
      'x,y,z\n'
      'a,b,c')

In [14]:
df=pd.read_csv(StringIO('data')

SyntaxError: incomplete input (3722987206.py, line 1)